Tekla.Structures.Drawing.GraphicObject
The GraphicObject class is the abstract base class for all graphic objects
(the arc, the circle, the cloud, the rectangular cloud, the line, the polygon, the polyline and the rectangle).

Tekla.Structures.Drawing.GraphicObject.#ctor
Creates a new graphic object instance.

Tekla.Structures.Drawing.GraphicObject.Hideable
Accesses the information if this object is hidden or not or if it should be.